package com.javarush.test.level09.lesson11.home05;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.util.ArrayList;

/* Гласные и согласные буквы
Написать программу, которая вводит с клавиатуры строку текста.
Программа должна вывести на экран две строки:
1. первая строка содержит только гласные буквы
2. вторая - только согласные буквы и знаки препинания из введённой строки.
Буквы соединять пробелом.

Пример ввода:
Мама мыла раму.
Пример вывода:
а а ы а а у
М м м л р м .
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        //Написать тут ваш код
        ArrayList<Character> l1 = new ArrayList<Character>();
        ArrayList<Character> l2 = new ArrayList<Character>();

        BufferedReader read = new BufferedReader(new InputStreamReader(System.in));

        for(char ch: read.readLine().toCharArray()){
            if(isVowel(ch)) l1.add(ch);
            else if (ch != ' ') l2.add(ch);
        }

        for (char ch:l1) System.out.print(ch + " ");
        System.out.println();
        for (char ch:l2) System.out.print(ch + " ");
    }

    public static char[] vowels = new char[]{'а', 'я', 'у', 'ю', 'и', 'ы', 'э', 'е', 'о', 'ё'};

    //метод проверяет, гласная ли буква
    public static boolean isVowel(char c)
    {
        c = Character.toLowerCase(c);  //приводим символ в нижний регистр - от заглавных к строчным буквам

        for (char d : vowels)   //ищем среди массива гласных
        {
            if (c == d)
                return true;
        }
        return false;
    }
}